{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Embedding","config":{"input_dim":13496,"output_dim":16,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":32,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,32]}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"name":"gru_GRU1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"reset_after":false,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"name":"gru_GRU2","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"reset_after":false,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true}},{"class_name":"GlobalAveragePooling1D","config":{"name":"global_average_pooling1d_GlobalAveragePooling1D1","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.26,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[13496,16],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/kernel","shape":[16,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/recurrent_kernel","shape":[64,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/kernel","shape":[16,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/recurrent_kernel","shape":[64,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/kernel","shape":[128,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/recurrent_kernel","shape":[64,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/bias","shape":[192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/kernel","shape":[128,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/recurrent_kernel","shape":[64,192],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/bias","shape":[192],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[128,32],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[2],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}